#### Preliminaries

In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

import seaborn as sns
import sys
print("Python version: {}".format(sys.version))

Python version: 3.5.1 |Anaconda custom (64-bit)| (default, Jun 15 2016, 15:32:45)
[GCC 4.4.7 20120313 (Red Hat 4.4.7-1)]

In [5]:
import sklearn
print("scikit-learn version: {}".format(sklearn.__version__))

scikit-learn version: 0.18.1

## The Titanic Data Set

The sinking of the RMS Titanic is one of the most infamous shipwrecks in history. 

On April 15, 1912, during her maiden voyage, the Titanic sank after colliding with an iceberg, killing 1502 out of 2224 passengers and crew. This sensational tragedy shocked the international community and led to better safety regulations for ships.

One of the reasons that the shipwreck led to such loss of life was that there were not enough lifeboats for the passengers and crew. Although there was some element of luck involved in surviving the sinking, some groups of people were more likely to survive than others, such as women, children, and the upper-class.

In this contest, we ask you to complete the analysis of what sorts of people were likely to survive. In particular, we ask you to apply the tools of machine learning to predict which passengers survived the tragedy.

This Kaggle Getting Started Competition provides an ideal starting place for people who may not have a lot of experience in data science and machine learning. *(Kaggle.com)*

The datasets can be downloaded from Kaggle.  https://www.kaggle.com/c/titanic

### Loading the Data
* Azure notebooks are clouded based, and can not (easily) connected to your machine.
* You can access data sets that are stored on a GitHub repository.
* You must specify the ***Raw*** URL. (i.e. ``...raw.githubusercontent.com..``)

In [6]:
# Load data
train = pd.read_csv('https://raw.githubusercontent.com/PyDataWorkshop/datasets/master/titanic/train.csv')  
test = pd.read_csv('https://raw.githubusercontent.com/PyDataWorkshop/datasets/master/titanic/test.csv')

*** Remark***
Data is now stored as a pandas dataframe.

## Data Exploration with Pandas

## Exploring the Data with ``pandas``.

1. Survival - Survival (0 = No; 1 = Yes). *Not included in test.csv file.*
2. Pclass - Passenger Class 
    - (1 = 1st; 2 = 2nd; 3 = 3rd)
3. Name - Name
4. Sex - Sex
5. Age - Age
6. SibSp - Number of Siblings/Spouses Aboard
7. Parch - Number of Parents/Children Aboard
8. Ticket - Ticket Number
9. Fare - Passenger Fare
10. Cabin - Cabin Name / Number
11. Embarked - Port of Embarkation 
 - (C = Cherbourg; Q = Queenstown; S = Southampton)

In [ ]:
print(train.columns.values)
#train.columns

In [7]:
train.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [8]:
train.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [9]:
test.head(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q

In [10]:
print ("Dimension of train data {}".format(train.shape))

Dimension of train data (891, 12)

In [ ]:
#train.dtypes
train.info()

In [ ]:
train.describe()

In [ ]:
print(train.columns.values)